IDEA Open Model
CrossSectionFactory.FillColdFormedRegularPolygon Method
Compatible with IDEA StatiCa 20.1
 Fill parameters for cold formed Regular polygon section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillColdFormedRegularPolygon(
	CrossSectionParameter css,
	double Radius,
	int Number,
	double Thickness,
	double InsideRadius
)
Public Shared Sub FillColdFormedRegularPolygon (
	css As CrossSectionParameter,
	Radius As Double,
	Number As Integer,
	Thickness As Double,
	InsideRadius As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Radius
Type: System.Double
Radius
Number
Type: System.Int32
Number
Thickness
Type: System.Double
Thickness
InsideRadius
Type: System.Double
Inside radius
Remarks
Dimension of cold formed Regular polygon section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 11;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Radius = 0.10;
int Number = 8;
double Thickness = 0.003;
double InsideRadius = 0.005;
CrossSectionFactory.FillColdFormedRegularPolygon(css, Radius, Number, Thickness, InsideRadius);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace